OdRxMemberQueryContext.find(OdArray&lt;OdSmartPtr&lt;OdRxClass&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdRxClass&gt;&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt16!System.Runtime.CompilerServices.IsConst*)
\details
Gets the pointer to the member of the class by name.
\param facets [in] Array of objects.
\param name   [in] The pointer to the name of member to be found.
\returns
Pointer to the member if it was found; NULL otherwise.

OdRxMemberQueryContext.newMemberIterator(OdArray&lt;OdSmartPtr&lt;OdRxClass&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdRxClass&gt;&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Builds an iterator listing all the members of these classes (optionally
including members of parents and children of members).
Parameters are called "facets", because they can include "extension"
classes.
\param facets [in] Array of objects.
\returns
Pointer to the iterator of the members of the specified objects.